In [30]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [31]:
#common task is to find the missing data
data = Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [32]:
#find the missing values
#true if a data is missing
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [33]:
#drop and remove null values
data.dropna()

0     one
1     two
3    four
dtype: object

In [34]:
#in dataFrame
dFrame = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dFrame

    0   1   2
0   1   2   3
1 NaN   5   6
2   7 NaN   9
3 NaN NaN NaN

In [35]:
cleanDFrame = dFrame.dropna()
#any row has any null value is dropped completely
#that is why it is the first row only

In [8]:
cleanDFrame

   0  1  2
0  1  2  3

In [36]:
#drop only rows which are missing all the null values
dFrame.dropna(how='all')

    0   1  2
0   1   2  3
1 NaN   5  6
2   7 NaN  9

In [37]:
#drop columns 
# every column has a null value and hence every column is dropped
dFrame.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [38]:
npn = np.nan
dFrame2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dFrame2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [39]:
#threshhold by the data which is not null
# in this example the last one is dropped because the threshhold is set to 2.
dFrame2.dropna(thresh = 2)

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9

In [40]:
dFrame2.dropna(thresh = 3)

   0   1  2   3
0  1   2  3 NaN
1  2 NaN  5   6

In [41]:
dFrame2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [42]:
#fill where null value with a value
dFrame2.fillna(1)

   0  1  2  3
0  1  2  3  1
1  2  1  5  6
2  1  7  1  9
3  1  1  1  1

In [43]:
#fill in different values for different columns
dFrame2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [44]:
#fill the columns with the values such as 0 with 0,1 with 1. it is a dictionary
dFrame2.fillna({0:0,1:1,2:2,3:3})

   0  1  2  3
0  1  2  3  3
1  2  1  5  6
2  0  7  2  9
3  1  1  2  3

In [46]:
#modify the existing object
#is for permananent
dFrame2.fillna(0,inplace = True)

In [47]:
dFrame2

   0  1  2  3
0  1  2  3  0
1  2  0  5  6
2  0  7  0  9
3  1  0  0  0